In [85]:
import pandas as pd
import gensim

import warnings

In [86]:
warnings.filterwarnings("ignore")

### Loading the Data

In [87]:
credits = pd.read_csv('data/credits.csv')
titles = pd.read_csv('data/titles.csv')

In [88]:
credits.head(5)

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [89]:
titles.head(5)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

### Exploratory Data Analysis

In [90]:
credits.isnull().sum()

person_id       0
id              0
name            0
character    9772
role            0
dtype: int64

In [91]:
credits[credits.character.isnull()].role.unique()

array(['DIRECTOR', 'ACTOR'], dtype=object)

In [93]:
credits['character'] = credits[(credits.character.isnull()) & (credits.role == 'DIRECTOR')]['character'].fillna('DIRECTOR')
credits['character'] = credits['character'].fillna('Unamed')
credits.isnull().sum()

person_id    0
id           0
name         0
character    0
role         0
dtype: int64

In [96]:
credits[(credits.character == 'DIRECTOR') & (credits.role == 'DIRECTOR')].head(5)

     person_id        id             name character      role
36        3308   tm84618  Martin Scorsese  DIRECTOR  DIRECTOR
59       17727  tm154986     John Boorman  DIRECTOR  DIRECTOR
106      11475  tm127384      Terry Jones  DIRECTOR  DIRECTOR
107      11473  tm127384    Terry Gilliam  DIRECTOR  DIRECTOR
162       1063  tm120801   Robert Aldrich  DIRECTOR  DIRECTOR

In [97]:
credits[(credits.character == 'Unamed') & (credits.role == 'ACTOR')].head(5)

   person_id       id             name character   role
0       3748  tm84618   Robert De Niro    Unamed  ACTOR
1      14658  tm84618     Jodie Foster    Unamed  ACTOR
2       7064  tm84618    Albert Brooks    Unamed  ACTOR
3       3739  tm84618    Harvey Keitel    Unamed  ACTOR
4      48933  tm84618  Cybill Shepherd    Unamed  ACTOR